Tekla.Structures.Dialog.UIControls.CustomObservableCollection`1
CustomObservableCollection for synchronizing UI controls.

Tekla.Structures.Dialog.UIControls.CustomObservableCollection`1.#ctor
CustomObservableCollection constructor.

Tekla.Structures.Dialog.UIControls.CustomObservableCollection`1.#ctor(System.Collections.Generic.IEnumerable{`0})
CustomObservableCollection constructor.
collection: The collection used in creation.

Tekla.Structures.Dialog.UIControls.CustomObservableCollection`1.#ctor(System.Collections.Generic.List{`0})
CustomObservableCollection constructor.
list: The list used in creation.

Tekla.Structures.Dialog.UIControls.CustomObservableCollection`1.Repopulate(System.Collections.Generic.IEnumerable{`0})
CustomObservableCollection repopulator, sends notification about property and collection change.
collection: The collection used in repopulation.